// 儲存檔名：d:\Chap04\J406_MultiArray.java

public class J406_MultiArray
{
	public static void main(String[] args)
	{
		int[][][] array = { { {000, 001, 002, 003}, {010, 011, 012, 013} },
				{ {100, 101, 102, 103}, {110, 111, 112, 113} },
				{ {200, 201, 202, 203}, {210, 211, 212, 213} },
				{ {300, 301, 302, 303}, {310, 311, 312, 313} },
				{ {400, 401, 402, 403}, {410, 411, 412, 413} },
				{ {500, 501, 502, 503}, {510, 511, 512, 513} } };
		System.out.println("array[1][0][2] = " + array[1][0][2]);	//顯示陣列元素的資料
		System.out.println("array[3][1][0] = " + array[3][1][0]);	//顯示陣列元素的資料
		System.out.println("array[5][0][3] = " + array[5][0][3]);	//顯示陣列元素的資料
	}
}
